#ifndef CONDITION_H
#define CONDITION_H

/*------------------------------------------------Подключаем библиотеки используемые в наших функциях----------------------------------------------------*/
#include<stdio.h>
#include<stdlib.h>
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/


/*---------------------------------------------------------------Создаем структуру, задающую дерево-----------------------------------------------------------------------*/
struct treeNode{
    struct treeNode *leftPtr; //Указатель на левую ветвь
    int data;//Информация, которая хранится  в данном ответвлении
    struct treeNode *rightPtr;//Указатель на правую ветвь
    struct treeNode *parent; //Указатель на родителя
};
/*-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------*/
//Создание псевдонимов
typedef struct treeNode TREENODE;
typedef TREENODE *TREENODEPTR;

int n, duplicates = 0; //ГЛОБАЛЬНЫЕ ПЕРЕМЕННЫЕ



#endif // CONDITION_H
