#ifndef VISUAL_H
#define VISUAL_H
#include<time.h>
//Функция откладки
void delay(double dly){
    const clock_t start = clock(); /* save start clock tick */
    clock_t current;
    do{ /* get current clock tick */
        current = clock();
    }
    while((double)(current-start)/CLOCKS_PER_SEC < dly); /* break loop when the requested number of seconds have elapsed */
}
void picture(void){

    printf("\n                          _$$$$___$$___$$____________$$____$$$$____________$$$$");
    delay(0.2);
    printf("\n                          $$__$$__$$$_$$$__________$$$$___$$__$$__________$$");
    delay(0.2);
    printf("\n                          $$$$$$__$$_$_$$___$$$$$____$$____$$$$___$$$$$___$$$$$");
    delay(0.2);
    printf("\n                          $$__$$__$$___$$____________$$___$$__$$__________$$__$$");
    delay(0.2);
    printf("\n                          $$__$$__$$___$$____________$$____$$$$____________$$$$");
    delay(0.2);
    printf("\n\n      $$$$$$__$$$$$___$$$$$$____$$$_____$$$$___$$$$$$___$$$$___$$$$$______$$$___$$$$$__$$$$$$__$$$$$$");
    delay(0.2);
    printf("\n      $$__$$__$$__$$__$$_______$$_$$___$$__$$____$$____$$__$$__$$__$$____$_$$__$$__$$__$$________$$");
    delay(0.2);
    printf("\n      $$__$$__$$$$$$__$$$$_____$$_$$___$$________$$____$$$$$$__$$$$$____$__$$___$$$$$__$$$$______$$");
    delay(0.2);
    printf("\n      $$__$$__$$______$$______$$$$$$$__$$__$$____$$____$$__$$__$$__$$__$$__$$__$$__$$__$$________$$");
    delay(0.2);
    printf("\n      $$__$$__$$______$$$$$$__$_____$___$$$$_____$$____$$__$$__$$$$$___$$__$$__$$__$$__$$$$$$____$$\n\n\n");
    delay(1.5);

     printf("\e[1;1H\e[2J");
}
void instructions(void)
{
printf("Можете выполнить одну из функций:\n"
"       1. Ввод дерева\n"
"       2. Печать дерева\n"
"       3. Удаление дерева\n"
"       4. Обходы:прямой, обратный, концевой\n"
"       5. Поэтажный обход дерева\n"
"       6. Высота дерева \n"
"       7. Копирование дерева \n"
"       8. Удаление элемента дерева \n"
"       9.    EXIT\n");
}
#endif // VISUAL_H
